[
    {
      "bookId": 1,
      "bookName": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "image": "https://i.ibb.co/YtQfrBw/kill-a-mockingbird.jpg",
      "review": "A timeless classic that explores themes of racial injustice and moral growth in a small southern town. The story follows Scout Finch, a young man growing up in the 1930s, as she learns valuable lessons about empathy, compassion, and the importance of standing up for what is right. If you enjoy thought-provoking narratives that tackle social issues, you may find this book to be a compelling read.",
      "totalPages": 336,
      "rating": 4.5,
      "category": "Fiction",
      "tags": ["Classics", "Social Justice"],
      "publisher": "HarperCollins",
      "yearOfPublishing": 1960
    },
    {
      "bookId": 2,
      "bookName": "1984",
      "author": "George Orwell",
      "image": "https://i.ibb.co/nmskGP4/1984.jpg",
      "review": "A dystopian masterpiece that explores the dangers of totalitarianism and the erosion of individual freedom. The story follows Winston Smith, a low-ranking member of the ruling Party, as he rebels against the oppressive regime and seeks to find truth and meaning in a world of lies and propaganda. If you enjoy thought-provoking and politically charged narratives, you may find this book to be a compelling read.",
      "totalPages": 328,
      "rating": 4.8,
      "category": "Fiction",
      "tags": ["Dystopian", "Political"],
      "publisher": "Secker & Warburg",
      "yearOfPublishing": 1949
    },
    {
      "bookId": 3,
      "bookName": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "image": "https://i.ibb.co/MZFCC8T/The-Great-Gatsby.jpg",
      "review": "A captivating tale of love, wealth, and the American Dream set in the Roaring Twenties. The story follows the enigmatic Jay Gatsby as he pursues his lost love, Daisy Buchanan, in a world of excess and illusion. If you enjoy stories of ambition, betrayal, and tragedy, you may find this book to be a compelling read. ",
      "totalPages": 180,
      "rating": 4.6,
      "category": "Fiction",
      "tags": ["Classics", "Romance"],
      "publisher": "Charles Scribner's Sons",
      "yearOfPublishing": 1925
    },
    {
      "bookId": 4,
      "bookName": "Pride and Prejudice",
      "author": "Jane Austen",
      "image": "https://i.ibb.co/w6sK84p/Pride-and-Prejudice.jpg",
      "review": "A delightful romantic comedy that satirizes the manners and morals of the British upper class. The story follows the Bennet sisters as they navigate the challenges of courtship and marriage in Regency-era England. If you enjoy witty dialogue and charming characters, you may find this book to be a delightful read.",
      "totalPages": 279,
      "rating": 4.7,
      "category": "Fiction",
      "tags": ["Classics", "Romance"],
      "publisher": "T. Egerton, Whitehall",
      "yearOfPublishing": 1813
    },
    {
      "bookId": 5,
      "bookName": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "image": "https://i.ibb.co/4pwgmLF/The-Catcher-in-the-Rye.jpg",
      "review": "A coming-of-age novel that explores the disillusionment of adolescence and the search for identity. The story follows Holden Caulfield as he navigates the challenges of growing up in New York City in the 1950s. If you enjoy introspective and character-driven narratives, you may find this book to be a compelling read.",
      "totalPages": 224,
      "rating": 4.4,
      "category": "Fiction",
      "tags": ["Classics", "Coming-of-Age"],
      "publisher": "Little, Brown and Company",
      "yearOfPublishing": 1951
    },
    {
      "bookId": 6,
      "bookName": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "image": "https://i.ibb.co/PZrRcFr/The-Hobbit.png",
      "review": "An enchanting adventure story set in Middle-earth, filled with dwarves, dragons, and epic quests. The book follows the journey of Bilbo Baggins as he sets out to reclaim a stolen treasure from the fearsome dragon Smaug. If you enjoy high fantasy and epic tales of heroism, you may find this book to be a delightful read.",
      "totalPages": 310,
      "rating": 4.6,
      "category": "Fantasy",
      "tags": ["Adventure", "Middle-earth"],
      "publisher": "George Allen & Unwin",
      "yearOfPublishing": 1937
    },
    {
      "bookId": 7,
      "bookName": "To the Lighthouse",
      "author": "Virginia Woolf",
      "image": "https://i.ibb.co/12J4tL8/To-the-Lighthouse.jpg",
      "review": "A groundbreaking modernist novel that explores themes of time, memory, and the complexities of human relationships. The story follows the Ramsay family as they spend a summer at their vacation home in Scotland, grappling with the passage of time and the loss of loved ones. If you enjoy experimental fiction that pushes the boundaries of narrative form, you may find this book to be a rewarding read.",
      "totalPages": 209,
      "rating": 4.3,
      "category": "Fiction",
      "tags": ["Modernist", "Stream of Consciousness"],
      "publisher": "The Hogarth Press",
      "yearOfPublishing": 1927
    },
    {
        "bookId": 8,
        "bookName": "The Alchemist",
        "author": "Paulo Coelho",
        "image": "https://i.ibb.co/8sRTfPT/The-Alchemist.jpg",
        "review": "A philosophical fable about following one's dreams and discovering the true meaning of life. The story follows Santiago, a young shepherd who embarks on a journey to find a hidden treasure in the Egyptian pyramids. Along the way, he learns valuable lessons about the importance of listening to one's heart and pursuing one's destiny. If you enjoy inspirational stories with spiritual themes, you may find this book to be a thought-provoking read.",
        "totalPages": 197,
        "rating": 4.4,
        "category": "Fiction",
        "tags": ["Philosophical", "Adventure"],
        "publisher": "HarperCollins",
        "yearOfPublishing": 1988
      },
      {
        "bookId": 9,
        "bookName": "Harry Potter and the Sorcerer's Stone",
        "author": "J.K. Rowling",
        "image": "https://i.ibb.co/ZmHbXtV/Harry-Potter-and-the-Sorcerer-s-Stone.jpg",
        "review": "The magical tale of a young boy who discovers he is a wizard and begins his journey at Hogwarts School of Witchcraft and Wizardry. This is the first book in the beloved Harry Potter series, which follows Harry and his friends as they battle dark forces and uncover the secrets of the wizarding world. If you enjoy stories of magic, friendship, and adventure, you may find this book to be a delightful read.",
        "totalPages": 320,
        "rating": 4.9,
        "category": "Fantasy",
        "tags": ["Magic", "Adventure"],
        "publisher": "Bloomsbury Publishing",
        "yearOfPublishing": 1997
      },
      {
        "bookId": 10,
        "bookName": "The Hunger Games",
        "author": "Suzanne Collins",
        "image": "https://i.ibb.co/C9RHwrw/The-Hunger-Games.png",
        "review": "In a dystopian future, teenagers are forced to fight to the death in a televised spectacle for the entertainment of the ruling class. The story follows Katniss Everdeen as she volunteers to take her sister's place in the deadly Hunger Games. This is a thrilling and action-packed novel that explores themes of survival, sacrifice, and rebellion. If you enjoy dystopian fiction",
        "totalPages": 374,
        "rating": 4.7,
        "category": "Science Fiction",
        "tags": ["Dystopian", "Adventure"],
        "publisher": "Scholastic Press",
        "yearOfPublishing": 2008
      },
      {
        "bookId": 11,
        "bookName": "The Da Vinci Code",
        "author": "Dan Brown",
        "image": "https://i.ibb.co/XbxrCfH/vinchi.jpg",
        "review": "A gripping thriller that follows symbologist Robert Langdon as he unravels a mystery involving a secret society and a hidden code. The book is filled with twists and turns that keep readers on the edge of their seats until the very end. If you enjoy fast-paced thrillers with historical and religious elements, you may find this book to be a thrilling read.",
        "totalPages": 454,
        "rating": 4.5,
        "category": "Mystery",
        "tags": ["Thriller", "Conspiracy"],
        "publisher": "Doubleday",
        "yearOfPublishing": 2003
      },
      {
        "bookId": 12,
        "bookName": "Gone Girl",
        "author": "Gillian Flynn",
        "image": "https://i.ibb.co/CWBYVHx/Gone-Girl.jpg",
        "review": "A psychological thriller that explores the complexities of marriage and the dark secrets that lie beneath the surface. The book alternates between the perspectives of Nick and Amy Dunne, a married couple whose relationship takes a sinister turn when Amy goes missing on their fifth wedding anniversary.This is a gripping and suspenseful novel that keeps readers guessing until the very end. So if you enjoy psychological thrillers with unexpected twists and turns, you may find it to be a compelling read.",
        "totalPages": 419,
        "rating": 4.6,
        "category": "Thriller",
        "tags": ["Mystery", "Suspense"],
        "publisher": "Crown Publishing Group",
        "yearOfPublishing": 2012
      }
      
      
    ]
    